[
  { "question_id": 1, "question": "What is the derivative of x^2?" },
  { "question_id": 2, "question": "Compute the integral of 3x^2 from 0 to 2." },
  { "question_id": 3, "question": "Solve for x: 2x + 5 = 17." },
  { "question_id": 4, "question": "Factor the polynomial: x^2 - 9." },
  { "question_id": 5, "question": "What is the limit of (sin x)/x as x approaches 0?" },
  { "question_id": 6, "question": "Find the slope of the line passing through (2, 3) and (6, 11)." },
  { "question_id": 7, "question": "Expand: (a + b)^3." },
  { "question_id": 8, "question": "Solve the system: x + y = 10 and x - y = 4." },
  { "question_id": 9, "question": "What is the area of a circle with radius 5?" },
  { "question_id": 10, "question": "Convert 0.125 to a fraction in simplest form." },

  { "question_id": 11, "question": "State Newton's second law of motion and give a simple example." },
  { "question_id": 12, "question": "What is the difference between speed and velocity?" },
  { "question_id": 13, "question": "If a car accelerates from 0 to 20 m/s in 5 s, what is its acceleration?" },
  { "question_id": 14, "question": "Explain the concept of conservation of energy." },
  { "question_id": 15, "question": "What is Ohm's law? Provide the formula and define the variables." },
  { "question_id": 16, "question": "Describe the difference between series and parallel circuits." },
  { "question_id": 17, "question": "What is the relationship between frequency, wavelength, and wave speed?" },
  { "question_id": 18, "question": "Explain why objects feel lighter in an elevator accelerating downward." },
  { "question_id": 19, "question": "What is the ideal gas law? Write it and explain each term." },
  { "question_id": 20, "question": "Define momentum and write its formula." },

  { "question_id": 21, "question": "What is the pH of a neutral solution at 25°C?" },
  { "question_id": 22, "question": "Explain the difference between an element and a compound." },
  { "question_id": 23, "question": "What is an isotope?" },
  { "question_id": 24, "question": "Balance the equation: H2 + O2 -> H2O." },
  { "question_id": 25, "question": "What is the difference between ionic and covalent bonds?" },
  { "question_id": 26, "question": "Define molarity and give an example calculation." },
  { "question_id": 27, "question": "What is the periodic trend of electronegativity across a period?" },
  { "question_id": 28, "question": "Explain what a catalyst does in a chemical reaction." },
  { "question_id": 29, "question": "What is the difference between endothermic and exothermic reactions?" },
  { "question_id": 30, "question": "Define oxidation and reduction in terms of electrons." },

  { "question_id": 31, "question": "What is DNA and what is its role in cells?" },
  { "question_id": 32, "question": "Explain the difference between mitosis and meiosis." },
  { "question_id": 33, "question": "What is photosynthesis? Provide the overall chemical equation." },
  { "question_id": 34, "question": "Describe how natural selection works in simple terms." },
  { "question_id": 35, "question": "What is a virus, and how is it different from a bacterium?" },
  { "question_id": 36, "question": "What is homeostasis? Give one example in humans." },
  { "question_id": 37, "question": "Explain the function of mitochondria." },
  { "question_id": 38, "question": "What is an ecosystem? Name two components." },
  { "question_id": 39, "question": "Describe the basics of the human immune response to infection." },
  { "question_id": 40, "question": "What is the difference between genotype and phenotype?" },

  { "question_id": 41, "question": "Name the capital of Canada." },
  { "question_id": 42, "question": "Which ocean is the largest by area?" },
  { "question_id": 43, "question": "What is the difference between latitude and longitude?" },
  { "question_id": 44, "question": "Name three countries that border Germany." },
  { "question_id": 45, "question": "What is the longest river in Africa?" },
  { "question_id": 46, "question": "Explain what causes seasons on Earth." },
  { "question_id": 47, "question": "What is a tectonic plate and what happens at plate boundaries?" },
  { "question_id": 48, "question": "Define the greenhouse effect in a few sentences." },
  { "question_id": 49, "question": "What is the difference between weather and climate?" },
  { "question_id": 50, "question": "Name two major mountain ranges in Europe." },

  { "question_id": 51, "question": "What year did World War II end?" },
  { "question_id": 52, "question": "Explain what the Renaissance was and why it mattered." },
  { "question_id": 53, "question": "Who wrote the Declaration of Independence and what was its purpose?" },
  { "question_id": 54, "question": "Summarize the main causes of the French Revolution." },
  { "question_id": 55, "question": "What was the Industrial Revolution? Mention two impacts." },
  { "question_id": 56, "question": "Explain what the Cold War was in one paragraph." },
  { "question_id": 57, "question": "What is the difference between a primary and a secondary historical source?" },
  { "question_id": 58, "question": "Name two ancient civilizations and one major achievement of each." },
  { "question_id": 59, "question": "What is democracy? Give a simple definition." },
  { "question_id": 60, "question": "Explain the concept of checks and balances in government." },

  { "question_id": 61, "question": "What is supply and demand? Explain how price is affected." },
  { "question_id": 62, "question": "Define inflation and give one common cause." },
  { "question_id": 63, "question": "What is GDP and what does it measure?" },
  { "question_id": 64, "question": "Explain the difference between a tax and a fee." },
  { "question_id": 65, "question": "What is opportunity cost? Provide an everyday example." },
  { "question_id": 66, "question": "Explain what a recession is." },
  { "question_id": 67, "question": "What is a market monopoly and why can it be harmful?" },
  { "question_id": 68, "question": "Describe what diversification means in investing." },
  { "question_id": 69, "question": "What is compound interest? Provide a simple numeric example." },
  { "question_id": 70, "question": "Explain the difference between fiscal policy and monetary policy." },

  { "question_id": 71, "question": "What is the difference between RAM and storage?" },
  { "question_id": 72, "question": "Define an algorithm and give a simple example." },
  { "question_id": 73, "question": "Explain the difference between a compiler and an interpreter." },
  { "question_id": 74, "question": "What is Big-O notation? Explain what it is used for." },
  { "question_id": 75, "question": "What is a hash function and what is it used for?" },
  { "question_id": 76, "question": "Explain what a database index is and why it helps." },
  { "question_id": 77, "question": "What is the difference between TCP and UDP?" },
  { "question_id": 78, "question": "Define an API and give an example of where it is used." },
  { "question_id": 79, "question": "What is version control? Why do teams use Git?" },
  { "question_id": 80, "question": "Explain the difference between authentication and authorization." },

  { "question_id": 81, "question": "In Python, what is the difference between a list and a tuple?" },
  { "question_id": 82, "question": "Write a Python function that returns the factorial of n (n >= 0)." },
  { "question_id": 83, "question": "Explain what a Python dictionary is and give an example." },
  { "question_id": 84, "question": "What does a null pointer mean in C or C++?" },
  { "question_id": 85, "question": "Explain what recursion is and give a simple example problem." },
  { "question_id": 86, "question": "What is a memory leak and how can it happen?" },
  { "question_id": 87, "question": "Describe the difference between pass-by-value and pass-by-reference." },
  { "question_id": 88, "question": "What is an exception? How do try and catch work conceptually?" },
  { "question_id": 89, "question": "Explain what unit testing is and why it is useful." },
  { "question_id": 90, "question": "What is a race condition? Provide a simple example scenario." },

  { "question_id": 91, "question": "Explain how a stack works and name two common operations." },
  { "question_id": 92, "question": "Explain how a queue works and name two common operations." },
  { "question_id": 93, "question": "What is a binary search and when can you use it?" },
  { "question_id": 94, "question": "Explain the difference between BFS and DFS in graphs." },
  { "question_id": 95, "question": "What is a balanced binary search tree and why does balance matter?" },
  { "question_id": 96, "question": "Explain what dynamic programming is and when it helps." },
  { "question_id": 97, "question": "Given an array of integers, how would you find the maximum subarray sum?" },
  { "question_id": 98, "question": "What is a greedy algorithm? Give one example where it works well." },
  { "question_id": 99, "question": "Explain what memoization is and how it differs from tabulation." },
  { "question_id": 100, "question": "What is the time complexity of sorting n numbers with merge sort?" },

  { "question_id": 101, "question": "Define supervised learning and give one example." },
  { "question_id": 102, "question": "Define unsupervised learning and give one example." },
  { "question_id": 103, "question": "What is overfitting? Name two ways to reduce it." },
  { "question_id": 104, "question": "Explain what a confusion matrix is." },
  { "question_id": 105, "question": "What is precision vs recall? When might you prefer higher recall?" },
  { "question_id": 106, "question": "Explain cross-validation and why it is used." },
  { "question_id": 107, "question": "What is a learning rate in gradient descent? What happens if it is too large?" },
  { "question_id": 108, "question": "Explain what an embedding is in machine learning." },
  { "question_id": 109, "question": "What is the difference between an L1 and L2 loss or regularization?" },
  { "question_id": 110, "question": "Explain why data leakage can invalidate model evaluation." },

  { "question_id": 111, "question": "What is Bayes' theorem? Provide the formula and a short explanation." },
  { "question_id": 112, "question": "A fair coin is flipped 5 times. What is the probability of exactly 3 heads?" },
  { "question_id": 113, "question": "Explain the difference between independent and mutually exclusive events." },
  { "question_id": 114, "question": "What is the expected value of a fair six-sided die roll?" },
  { "question_id": 115, "question": "Explain what a p-value is in hypothesis testing (conceptually)." },
  { "question_id": 116, "question": "What is a confidence interval? What does 95% mean in practice?" },
  { "question_id": 117, "question": "Explain the difference between correlation and causation." },
  { "question_id": 118, "question": "Given mean 10 and standard deviation 2, what is the z-score of value 14?" },
  { "question_id": 119, "question": "Explain what a Type I and Type II error are." },
  { "question_id": 120, "question": "Why can the median be a better measure than the mean for skewed data?" },

  { "question_id": 121, "question": "What is a vector and what is a matrix? Give a simple example of each." },
  { "question_id": 122, "question": "Compute the dot product of (1, 2, 3) and (4, 0, -1)." },
  { "question_id": 123, "question": "Explain what an eigenvector and eigenvalue represent intuitively." },
  { "question_id": 124, "question": "What does it mean for two vectors to be orthogonal?" },
  { "question_id": 125, "question": "Explain what matrix multiplication represents in linear transformations." },
  { "question_id": 126, "question": "Solve: If A is 2x2 identity matrix, what is A times any vector v?" },
  { "question_id": 127, "question": "Explain what a basis is in a vector space." },
  { "question_id": 128, "question": "What is the determinant of a matrix used for, conceptually?" },
  { "question_id": 129, "question": "Describe the geometric meaning of the cross product in 3D." },
  { "question_id": 130, "question": "Explain what singular value decomposition (SVD) is used for at a high level." },

  { "question_id": 131, "question": "Explain the difference between encryption and hashing." },
  { "question_id": 132, "question": "What is a public key and private key used for?" },
  { "question_id": 133, "question": "Describe what phishing is and how to reduce risk." },
  { "question_id": 134, "question": "What is SQL injection, conceptually? How do parameterized queries help?" },
  { "question_id": 135, "question": "Explain the principle of least privilege." },
  { "question_id": 136, "question": "What is a denial-of-service attack at a high level?" },
  { "question_id": 137, "question": "What are cookies in web browsers and what are they used for?" },
  { "question_id": 138, "question": "Explain what two-factor authentication is and why it helps." },
  { "question_id": 139, "question": "What is the difference between symmetric and asymmetric encryption?" },
  { "question_id": 140, "question": "Explain what a vulnerability disclosure process is and why it matters." },

  { "question_id": 141, "question": "Summarize the following in one sentence: The sun is the star at the center of our solar system." },
  { "question_id": 142, "question": "Rewrite this sentence to be more formal: I think this is kinda good." },
  { "question_id": 143, "question": "Provide three synonyms for the word important." },
  { "question_id": 144, "question": "Explain the difference between active voice and passive voice." },
  { "question_id": 145, "question": "Write a short paragraph explaining why clear documentation matters in software." },
  { "question_id": 146, "question": "Correct the grammar: She don't like going to school." },
  { "question_id": 147, "question": "Give an example of a metaphor and explain what it means." },
  { "question_id": 148, "question": "Write a concise email asking a professor for clarification on an assignment." },
  { "question_id": 149, "question": "Explain what a thesis statement is in essay writing." },
  { "question_id": 150, "question": "Provide a short outline for an essay about the pros and cons of remote work." },

  { "question_id": 151, "question": "Translate to English: Bonjour, comment allez-vous?" },
  { "question_id": 152, "question": "Translate to English: Ich lerne jeden Tag." },
  { "question_id": 153, "question": "Translate to English: Gracias por tu ayuda." },
  { "question_id": 154, "question": "Explain the difference between literal and figurative language." },
  { "question_id": 155, "question": "Write two alternative titles for a report about climate trends." },
  { "question_id": 156, "question": "Explain what ambiguity in language is and give one example." },
  { "question_id": 157, "question": "Rewrite this to be shorter without losing meaning: The reason is because it is due to the fact that." },
  { "question_id": 158, "question": "Provide three questions you would ask to clarify an ambiguous user request." },
  { "question_id": 159, "question": "Explain what rhetorical questions are and why writers use them." },
  { "question_id": 160, "question": "Write a short, friendly message congratulating a friend on a new job." },

  { "question_id": 161, "question": "What is utilitarianism in ethics? Describe it briefly." },
  { "question_id": 162, "question": "Explain deontology and how it differs from consequentialism." },
  { "question_id": 163, "question": "What is a conflict of interest? Provide an example." },
  { "question_id": 164, "question": "Describe one ethical risk of using AI in hiring." },
  { "question_id": 165, "question": "Explain what fairness means in machine learning and name one metric." },
  { "question_id": 166, "question": "What is privacy? Give a practical example of protecting it online." },
  { "question_id": 167, "question": "Explain what informed consent is in research." },
  { "question_id": 168, "question": "Describe one argument for and one argument against facial recognition in public spaces." },
  { "question_id": 169, "question": "What does transparency mean for an AI system? Give two concrete examples." },
  { "question_id": 170, "question": "Explain what a model audit is and why it can be valuable." },

  { "question_id": 171, "question": "If all bloops are razzies and all razzies are lazzies, are all bloops lazzies? Explain." },
  { "question_id": 172, "question": "A bat and a ball cost 1.10 in total. The bat costs 1.00 more than the ball. How much does the ball cost?" },
  { "question_id": 173, "question": "You have two containers: one with 3 red and 2 blue balls, another with 1 red and 4 blue balls. Which container gives a higher chance of drawing a red ball?" },
  { "question_id": 174, "question": "Explain the Monty Hall problem in simple terms." },
  { "question_id": 175, "question": "What is a paradox? Provide one famous example and explain why it is paradoxical." },
  { "question_id": 176, "question": "What is the difference between deductive and inductive reasoning?" },
  { "question_id": 177, "question": "Explain Occam's razor and one situation where it applies." },
  { "question_id": 178, "question": "If a statement is true, what is the truth value of its negation?" },
  { "question_id": 179, "question": "Define the term necessary condition vs sufficient condition with examples." },
  { "question_id": 180, "question": "Explain why correlation does not imply causation using a concrete example." },

  { "question_id": 181, "question": "What is a Docker container and why might you use it?" },
  { "question_id": 182, "question": "Explain what a virtual environment is in Python and why it helps." },
  { "question_id": 183, "question": "What is continuous integration (CI)? Give one benefit." },
  { "question_id": 184, "question": "Explain what logging is in software and why it matters." },
  { "question_id": 185, "question": "What is a REST API and what are common HTTP methods?" },
  { "question_id": 186, "question": "What is the difference between JSON and YAML?" },
  { "question_id": 187, "question": "Explain what latency and throughput mean in system performance." },
  { "question_id": 188, "question": "What is caching? Give one example where it improves performance." },
  { "question_id": 189, "question": "Explain what load balancing is and why it is used." },
  { "question_id": 190, "question": "What is a deadlock in concurrent systems? Give a simple example." },

  { "question_id": 191, "question": "Explain what reproducibility means in scientific experiments." },
  { "question_id": 192, "question": "Give two reasons why experiments should log random seeds." },
  { "question_id": 193, "question": "What is a baseline model and why is it important?" },
  { "question_id": 194, "question": "Explain the difference between evaluation and validation in ML." },
  { "question_id": 195, "question": "Describe a simple protocol for manually reviewing model outputs for errors." },
  { "question_id": 196, "question": "What is dataset bias? Provide one example." },
  { "question_id": 197, "question": "Explain what prompt injection is at a high level." },
  { "question_id": 198, "question": "What is the difference between robustness and generalization?" },
  { "question_id": 199, "question": "Explain what an ablation study is and why it is useful." },
  { "question_id": 200, "question": "Write a short checklist for running a careful evaluation of an LLM." }
]